#===============================================================================
# файл, содержащий вспомогательные функции
#===============================================================================

import numpy as np # для работы с массивами

def cosine_similarity(v1: np.array, v2: np.array): # функция для подсчёта косинусной близости между векторами
    return np.dot(v1, v2)/(np.linalg.norm(v1, ord=2, axis=-1) * np.linalg.norm(v2, ord=2)) # возвращаем косинусное сходство (axis=-1 ~ фиксируем последнюю размерность (столбцы) и идём по строкам)
